Revit 2027 API
OverrideGraphicSettings.SetCutForegroundPatternVisible Method
 Sets the visibility of the cut face foreground fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetCutForegroundPatternVisible(
	bool fillPatternVisible
)
Public Function SetCutForegroundPatternVisible (
	fillPatternVisible As Boolean
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetCutForegroundPatternVisible(
	bool fillPatternVisible
)
member SetCutForegroundPatternVisible :
        fillPatternVisible : bool -> OverrideGraphicSettings
Parameters
fillPatternVisible Boolean
 Value of the visibility of the cut face foreground fill pattern.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace